app/controllers/concerts_controller.rb

SELECT "concerts".* FROM "concerts" ORDER BY created_at DESC
SELECT COUNT(*) FROM "concerts"
---
  def index
    @concerts = Concert.order("created_at DESC").page(params[:page]).per(3)

SELECT "concerts".* FROM "concerts" WHERE "concerts"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @concert = Concert.find(params[:id])

INSERT INTO "concerts" ("created_at", "date", "full_desc", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "name_art", "price", "song", "time_dur", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    @concert = Concert.new(params[:concert])

    respond_to do |format|
      if @concert.save